Repository: Smorkster/AHK-Updater-WPF-
Catalog: AHK Updater/Localization/Localization.*.resx
Languages: sv_se

# BtnAddForExtractionContent
source: Add to extraction
sv_se: Lägg till för extraktion

# BtnCancelExtractionContent
source: Cancel extraction
sv_se: Avbryt extraktion

# BtnCancelPathContent
source: Cancel
sv_se: Avbryt

# BtnChangeSaveContent
source: Save changeinfo
sv_se: Spara changeinfo

# BtnDeleteContent
source: Delete
sv_se: Ta bort

# BtnEditorForOpeningFilesScriptContent
source: Open script
sv_se: Öppna skript

# BtnEditorForOpeningFilesXMLContent
source: Open XML
sv_se: Öppna XML

# BtnExtractToScriptContent
source: Extract to script
sv_se: Extrahera till skript

# BtnExtractToXmlContent
source: Extract to XML
sv_se: Extrahera till XML

# BtnFunctionAddParameterContent
source: Add parameter
sv_se: Lägg till parameter

# BtnFunctionRemoveParameterToolTip
source: Remove parameter
sv_se: Ta bort parameter

# BtnFunctionSaveContent
source: Save function
sv_se: Spara funktion

# BtnGetSettingFolder
source: Select a folder
sv_se: Välj en mapp

# BtnHotstringSaveContent
source: Save hotstring
sv_se: Spara hotstring

# BtnImportFileContent
source: Select file
sv_se: Välj fil

# BtnImportReadFile
source: Read file content
sv_se: Läs in fil

# BtnImportSelectAll
source: Select all
sv_se: Markera alla

# BtnImportSelectNone
source: Deselect all
sv_se: Avmarkera alla

# BtnRemoveFromExtractListContent
source: Remove from extraction list
sv_se: Ta bort från extraheringslistan

# BtnSaveContent
source: Save to file
sv_se: Spara till fil

# BtnSaveSettingsContent
source: Save settings
sv_se: Spara inställningar

# BtnSelectPathContent
source: Select
sv_se: Välj

# BtnStartImport
source: Import file
sv_se: Starta import

# BtnVariableSaveContent
source: Save variable
sv_se: Spara variabel

# CbAdvancedHotstringContent
source: Advanced hotstring
sv_se: Avancerad hotstring

# CbAdvancedHotstringToolTip
source: An advanced hotstring, errorchecking will not be done
sv_se: En avancerad hotstring, ingen felkontroll görs på koden

# CbSaveWithMenuContent
source: Include GUI for menu
sv_se: Inkludera GUI för meny

# CodeNewFunctionInfo
source: Code for function here
sv_se: Kod för funktionen här

# CodeNewParameter
source: NewParameter
sv_se: NyParameter

# ExpImportHeader
source: Import old data
sv_se: Importera gammal fil

# ExpParametersHeader
source: Parameters
sv_se: Parametrar

# GrpBoxApplicationSettingsHeader
source: Application-settings
sv_se: Applikations-inställningar

# GrpBoxFunctionSettingsHeader
source: Functional settings
sv_se: Funktionsinställningar

# GrpBoxFunctionSettingsScriptOperationsHeader
source: Scriptoperations
sv_se: Inställningar för skript

# GrpBoxScriptSettingsHeader
source: Script settings
sv_se: Skriptinställningar

# GrpBoxSectionTextsHeader
source: Section texts
sv_se: Textavsnitt

# HotstringVerifySaveUnsavedEdit
source: A hotstring is currently being edited, do you which to save this?
sv_se: En hotstring håller på att redigeras, vill du spara denna?

# HotstringVerifySaveUnsavedEditNew
source: A new hotstring is currently being created, do you which to save this?
sv_se: En ny hotstring håller på att skapas, vill du spara denna?

# LblAhkMenuTriggerTitleContent
source: Menu trigger
sv_se: Trigger för GUI-menyn

# LblChangeNameTitleContent
source: Change date
sv_se: Change datum

# LblEditorForOpeningFilesContent
source: Select editor to open files with
sv_se: Välj redigerare att öppna filer med

# LblFunctionNameTitleContent
source: Function name
sv_se: Funktionsnamn

# LblFunctionsToImportTitle
source: Functions
sv_se: Funktioner

# LblHotstringMenuItemTitleContent
source: Menu title
sv_se: Meny titel

# LblHotstringNameTitleContent
source: Hotstring name
sv_se: Hotstring namn

# LblImportFileContent
source: File to import
sv_se: Fil att importera

# LblSectionTextFunctionsTitleTitleContent
source: Title for functions-section
sv_se: Titel för funktions-avsnittet

# LblSectionTextHotstringsTitleTitleContent
source: Title for hotstrings-section
sv_se: Titel för hotstrings-avsnittet

# LblSectionTextMenuActionTriggersTitleTitleContent
source: Title for menutriggers-section
sv_se: Titel för menytriggers-avsnittet

# LblSectionTextMenuTitleTitleContent
source: Title for menu-section
sv_se: Titel för meny-avsnittet

# LblSectionTextTitleDeviderTitleTitleContent
source: Titledivider-character
sv_se: Tecken för titel avdelning

# LblSectionTextVariablesTitleTitleContent
source: Title for variables-section
sv_se: Titel för variabler-avsnittet

# LblVariableNameTitleContent
source: Variable name
sv_se: Variabel namn

# LblVariablesToImportTitle
source: Variables
sv_se: Variabler

# LblVariableValueTitleContent
source: Value
sv_se: Värde

# LvExtractListTitleContent
source: Items to extract
sv_se: Objekt att extrahera

# MainMenuNewCommand
source: New command
sv_se: Nytt objekt

# MainMenuNewFunction
source: Function
sv_se: Funktion

# MainMenuNewVariable
source: Variable
sv_se: Variabel

# MsgCultureChanged
source: The new culture will be used at next startup
sv_se: Den nya kulturen kommer användas nästa gång applikationen startas

# MsgErrorReadingFile
source: Error when reading file. Will start with empty content
sv_se: Fel vid läsning av fil. Innehållet kommer vara tomt.

# MsgExtractedTo
source: Selected objects extracted to:
sv_se: Valda objekt extraherade till:

# MsgImportedFunctions
source: functions
sv_se: funktioner

# MsgImportedVariables
source: variables
sv_se: variabler

# MsgNoXmlFileFound
source: Couldn't find any XML-file to read content. Will start with empty content.
sv_se: Hittade ingen XML-fil. Innehållet kommer vara tomt.

# MsgNumImported
source: items were imported
sv_se: importer gjordes

# MsgQSaveBeforeClosing
source: There are unsaved changes. Do you want to save these before closing the application?
sv_se: Det finns osparade ändringar. Vill du spara dessa innan applikationen avslutas?

# MsgQSaveBeforeClosingBtn1
source: Save (script without GUI)
sv_se: Spara (skript utan GUI)

# MsgQSaveBeforeClosingBtn2
source: Save (script with GUI)
sv_se: Spara (skript med GUI)

# MsgQSaveBeforeClosingBtn3
source: Cancel
sv_se: Avbryt

# MsgQSaveBeforeClosingTitle
source: Unsaved changes
sv_se: Osparade ändringar

# MsgSaveBeforeClosing
source: Data have been changed, but is not saved. Do you want to save before closing the application?
sv_se: Data har ändrats, men sparas inte. Vill du spara innan stänger applikationen?

# ScriptFileCreatedAt
source: Created at
sv_se: Skapades

# SettingsResetValueButtonContent
source: Reset to default
sv_se: Återställ standardvärde

# SuggestedPathAttributesHeader
source: Attributes
sv_se: Attribut

# SuggestedPathHeader
source: Path
sv_se: Sökväg

# TiFunctionsHeader
source: Functions
sv_se: Funktioner

# TiHVariablesHeader
source: Variables
sv_se: Variabler

# TiSettingsHeader
source: Settings
sv_se: Inställningar

# TiToExtractHeader
source: To extract
sv_se: Att extrahera

# ValidationErrorFunctionCodeEmpty
source: Code must contain something
sv_se: Kod får inte vara tom

# ValidationErrorFunctionNameAlreadyInUse
source: Name is already in use
sv_se: Namnet används redan

# ValidationErrorFunctionNameContainsWhiteSpace
source: Name can not contain any whitespace character
sv_se: Namnet får inte innehålla blanksteg

# ValidationErrorFunctionNameEmpty
source: Name can not be empty
sv_se: Namn måste anges

# ValidationErrorHotstringCodeEmpty
source: Code must contain something
sv_se: Kod måste anges

# ValidationErrorHotstringCodeNoParenthesis
source: Code will not post text
sv_se: Koden kommer inte kunna posta text

# ValidationErrorHotstringNameAlreadyInUse
source: Name is already in use
sv_se: Namnet används redan

# ValidationErrorHotstringNameContainsWhiteSpace
source: Name can not contain any whitespace character
sv_se: Namnet får inte innehålla blanksteg

# ValidationErrorHotstringNameEmpty
source: Name can not be empty
sv_se: Namn måste anges

# ValidationErrorHotstringSystemContainsWhiteSpace
source: Systemname can not contain any whitespace character
sv_se: Systemnamn kan inte innehålla blanksteg

# ValidationErrorHotstringSystemEmpty
source: System can not be empty
sv_se: System måste anges

# ValidationErrorNameAlreadyInUseAsFunction
source: Name is already in use as a function
sv_se: Namnet används redan som funktion

# ValidationErrorNameAlreadyInUseAsHotstring
source: Name is already in use as a hotstring
sv_se: Namnet används redan som hotstring

# ValidationErrorNameAlreadyInUseAsSetting
source: Name is already in use as a setting
sv_se: Namnet används redan för en inställning

# ValidationErrorNameAlreadyInUseAsVariable
source: Name is already in use as a variable
sv_se: Namnet används redan som variabel

# ValidationErrorParameterNameAlreadyInUse
source: Name of parameter already exists in this function
sv_se: Parameternamn används redan i funktionen

# ValidationErrorSettingDirectoryDoesNotExist
source: Directory does not exist
sv_se: Mapp finns inte

# ValidationErrorSettingNotOneOfAvailableValues
source: is not one of available valid values
sv_se: är inte ett tillgängligt, giltigt värde

# ValidationErrorSettingValueEmpty
source: must have a value set
sv_se: måste ha ett angivet värde

# ValidationErrorVariableNameAlreadyInUse
source: Name is already in use
sv_se: Namnet används redan

# ValidationErrorVariableNameContainsWhiteSpace
source: Name can not contain any whitespace character
sv_se: Namnet får inte innehålla blanksteg

# ValidationErrorVariableNameEmpty
source: Name can not be empty
sv_se: Namn måste anges

# ValidationInvalidCulture
source: The culture specified in the save-file is not valid. Default value of 'en' (english) will be used.
sv_se: Kulturen som anges i spara-filen är inte giltig. Standardvärdet 'en' (engelska) kommer att användas.

# ValidationInvalidCultureInfoUsed
source: The string located in the save-file is:
sv_se: Strängen som finns i spara-filen är:

# ValidationNoCultureSpecified
source: No culture have been specified in the save-file. Default value of 'en' (english) will be used.
sv_se: Ingen kultur har specificerats i spara-filen. Standardvärdet 'en' (engelska) kommer att användas.

# ValidationWarningFunctionCodeEmpty
source: Code should contain something
sv_se: Koden bör innehålla något

# ValidationWarningHotstringMenuTitleEmpty
source: If menutitle is left empty, a default string will be used
sv_se: Om menytitel lämnas tom kommer en standardsträng användas

# ValidationWarningVariableValueEmpty
source: Value should be set to something
sv_se: Värde bör var angivet
